/*Задано бинарное дерево. Необходимо проверить, является ли оно поисковым.Будем
предполагать, что в бинарном поисковом дереве могут быть вершины с
одинаковыми ключами. Тогда, для того, чтобы дерево было поисковым, должно
выполняться следующее требование: для каждой вершины $x$ все ключи в левом
поддереве вершины $x$ меньше ключа вершины $x$, а все ключи в правом
поддереве больше либо равны ключу вершины $x$.

Input
Первая строка входного файла содержит единственное целое число $n$ ($1 \leq n \leq 8 \cdot 10^5$) –
количество вершин в дереве.Следующая строка содержит одно целое число $m$
($-2^{31} \leq m \leq 2^{31} - 1$) – значение в корневой вершине дерева.В
каждой из последующих $n - 1$ строк через пробелы перечисляются три параметра
$m$, $p$ и $c$, которые задают какую-либо вершину дерева.$m$ – целое число
($-2^{31} \leq m \leq 2^{31} - 1$), значение, записанное в вершине.$p$ –
целое число ($1 \leq p \leq n - 1$), номер строки входного файла, в которой
был задан родитель текущей вершины (нумерация строк с нуля). Гарантируется,
что $p$ меньше, чем номер текущей строки.$c$ может принимать одно из двух
значений `L' или `R'. Значение `L' указывает на то, что текущая вершина
присоединена к родительской слева, `R' – справа.Гарантируется, что
совокупность всех строк задает корректное бинарное дерево.

Output
В единственной строке выведите "YES", если заданное дерево является бинарным
деревом поиска, и "NO" в противном случае.*/

#include <fstream>
#include <vector>

using namespace std;

int main()
{
    ifstream in("bst.in");
    ofstream out("bst.out");

    int size;
    in >> size;

    vector<int> values(size + 1); 
    vector<pair<long long, long long>> intervals(size + 1);

    in >> values[1];
    intervals[1].first = INT_MIN;
    intervals[1].second = (long long)INT_MAX + 1;

    int parent;
    char place;
    for (int i = 2; i <= size; ++i)
    {
        in >> values[i] >> parent >> place;


        if (place == 'L')
        {
            intervals[i].first = intervals[parent].first;
            intervals[i].second = values[parent];
        }
        else
        {
            intervals[i].first = values[parent];
            intervals[i].second = intervals[parent].second;
        }

        if (!((long long)values[i] >= intervals[i].first && (long long)values[i] < intervals[i].second))
        {
            out << "NO" << endl;
            return 0;
        }
    }

    out << "YES" << endl;
    
    return 0;
}